import time
import asyncio
from config import OWNER_ID
from pyrogram import Client, filters
from YukkiMusic import app
import random
from strings.filters import command
from pyrogram.types import Message, InlineKeyboardMarkup, InlineKeyboardButton
from pyrogram.enums import ParseMode, ChatMemberStatus

iddof = []


@app.on_message(
    command(["داخستنی زکر"])
    & filters.group
)
async def lllock(client, message):
    dev = (OWNER_ID)
    haya = (833360381)
    get = await client.get_chat_member(message.chat.id, message.from_user.id)
    if get.status in [ChatMemberStatus.ADMINISTRATOR]:
        rotba = "ئەدمین"
    elif get.status in [ChatMemberStatus.OWNER]:
        rotba = "سەرۆك"
    elif message.from_user.id in haya:
        rotba = "پڕۆگرامساز"
    elif message.from_user.id in dev:
        rotba = "گەشەپێدەر"

    if get.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] and dev:
        if message.chat.id in iddof:
            return await message.reply_text(f"**{message.from_user.mention}\n زکر پێشتر داخراوە♥️❎•**")
        iddof.append(message.chat.id)
        return await message.reply_text(
            f"**بە سەرکەوتوویی فەرمانی زکر داخرا\n\n لەلایەن {rotba} ←{message.from_user.mention}♥️❎•**")


@app.on_message(
    command(["کردنەوەی زکر"])
    & filters.group
)
async def idljjopen(client, message):
    dev = (OWNER_ID)
    haya = (833360381)
    get = await client.get_chat_member(message.chat.id, message.from_user.id)
    if get.status in [ChatMemberStatus.ADMINISTRATOR]:
        rotba = "ئەدمین"
    elif get.status in [ChatMemberStatus.OWNER]:
        rotba = "سەرۆك"
    elif message.from_user.id in haya:
        rotba = "پڕۆگرامساز"
    elif message.from_user.id in dev:
        rotba = "گەشەپێدەر"

    if get.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] and dev:
        if not message.chat.id in iddof:
            return await message.reply_text(f"**{message.from_user.mention}\n زکر پێشتر کراوەتەوە♥️✅•**")
        iddof.remove(message.chat.id)
        return await message.reply_text(
            f"**بە سەرکەوتوویی فەرمانی وەڵامدانەوە کرایەوە\n\n لەلایەن {rotba} ←{message.from_user.mention}♥️✅•**")


@app.on_message(
    command(["زکر"])

)
async def idjjdd(client, message):
    if message.chat.id in iddof:
        return
    usr = await client.get_chat(message.from_user.id)
    name = usr.first_name
    i = [

        "االلَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ , وَشُكْرِكَ , وَحُسْنِ عِبَادَتِكَ🎈💞 ",
        "من الأدعية النبوية المأثورة:اللهمَّ زَيِّنا بزينة الإيمان",
        "اااللهم يا من رويت الأرض مطرا أمطر قلوبنا فرحا 🍂 ",
        "اا‏اللَّهُـمَّ لَڪَ الحَمْـدُ مِنْ قَـا؏ِ الفُـؤَادِ إلىٰ ؏َـرشِڪَ المُقـدَّس حَمْـدَاً يُوَافِي نِـ؏ـمَڪ 💙🌸",
        "﴿وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا﴾🌿✨",
        "﴿وَمَن يَتَّقِ اللهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا﴾",
        "«سُبْحَانَ اللهِ ، وَالحَمْدُ للهِ ، وَلَا إلَهَ إلَّا اللهُ ، وَاللهُ أكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إلَّا بِاللهِ»🍃",
        "وذُنُوبًا شوَّهتْ طُهْرَ قُلوبِنا؛ اغفِرها يا ربّ واعفُ عنَّا ❤️",
        "«اللَّهُمَّ اتِ نُفُوسَنَا تَقْوَاهَا ، وَزَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا ، أنْتَ وَلِيُّهَا وَمَوْلَاهَا»🌹",
        "۝‏﷽إن اللَّه وملائكته يُصلُّون على النبي ياأيُّها الذين امنوا صلُّوا عليه وسلِّموا تسليما۝",
        "فُسِبًحً بًحًمًدٍ ربًکْ وٌکْنِ مًنِ الَسِاجّدٍيَنِ 🌿✨",
        "اأقُمً الَصّلَاةّ لَدٍلَوٌکْ الَشُمًسِ إلَيَ غُسِقُ الَلَيَلَ🥀🌺",
        "نِسِتٌغُفُرکْ ربًيَ حًيَتٌ تٌلَهّيَنِا الَدٍنِيَا عٌنِ ذِکْرکْ🥺😢",
        "وٌمًنِ أعٌرض عٌنِ ذِکْريَ فُإنِ لَهّ مًعٌيَشُةّ ضنِکْا 😢",
        "وٌقُرأنِ الَفُجّر إنِ قُرانِ الَفُجّر کْانِ مًشُهّوٌدٍا🎀🌲",
        "اأّذّأّ أّلَدِنِيِّأّ نَِّستّګوِ أّصٌلَګوِ زِّوِروِ أّلَمَقِأّبِر💔",
        "حًتٌيَ لَوٌ لَمًتٌتٌقُنِ الَخِفُظُ فُمًصّاحًبًتٌ لَلَقُرانِ تٌجّعٌلَکْ مًنِ اهّلَ الَلَهّ وٌخِاصّتٌهّ❤️🌱",
        "وٌإذِا رضيَتٌ وٌصّبًرتٌ فُهّوٌ إرتٌقُاء وٌنِعٌمًةّ✨??",
        "«ربً اجّعٌلَنِيَ مًقُيَمً الَصّلَاةّ وٌمًنِ ذِريَتٌيَ ربًنِا وٌتٌقُبًلَ دٍعٌاء 🤲",
        "ااعٌلَمً انِ رحًلَةّ صّبًرکْ لَهّا نِهّايَهّ عٌظُيَمًهّ مًحًمًلَهّ بًجّوٌائزٍ ربًانِيَهّ مًدٍهّشُهّ🌚☺️",
        "اإيَاکْ وٌدٍعٌوٌةّ الَمًظُلَوٌمً فُ إنِهّا تٌصّعٌدٍ الَيَ الَلَهّ کْأنِهّا شُرارهّ مًنِ نِار 🔥🥺",
        "االَلَهّمً انِقُذِ صّدٍوٌرنِا مًنِ هّيَمًنِهّ الَقُلَقُ وٌصّبً عٌلَيَهّا فُيَضا مًنِ الَطِمًأنِيَنِهّ✨🌺",
        "يَابًنِيَ إنِ صّلَاح الَحًيَاةّ فُ أتٌجّاهّ الَقُبًلَهّ 🥀🌿",
        "الَلَهّمً ردٍنِا إلَيَکْ ردٍا جّمًيَلَا💔🥺",
        "أعوذ بكلمات الله التامات من الفقد والإحتياج وعتمة الرُوح، وكل يأس تأتي به الحياة",
        "أستغفرالله الذي لا إله إلا هو الحي القيوم وأتوب إليه",
        "اللهم أسعدنا براحة البال ، وجملنا بالستر ومتعنا بالصحة ، وارزقنا رضاك والجنة",
        "‏الحمدلله على مساحات التجدد المتسعة لنا في هذه الحياة ، الحمدلله على نعمة الاستدارك بعد الخطأ وضياء التيقّظ بعد غشاوة الغفلة والذهول ووهج الحماس بعد الفتور ومعاودة الإشراق بعد الذبول لك أصدق الحمد يا الله على شتّى الفرص التي نقوّم بها ذواتنا إذا اعوجّت بين مسالك الأيام",
        "آميّن لكل الدعواتّ التي لايعرفهّا سوى الله لكل الأمنيات التي نبكي عليّها والمخاوف التيّ نبكي منها آميّن لكل مافي قلوبنّا",
        "إذا طُلب منك الدعاء لفلان وفترت عنه وعجزت فادعُ بِـاللهم اقضِ حاجة كُل مَن وكلني لدُعَائك، فَيقضي اللَّه ‏حاجتهُ وحاجتَك",
    ]

    while True:
        ik = random.choice(i)
        await message.reply_text(f"**زکری ڕۆژانە ❤️\n \n: {ik}**")
        await asyncio.sleep(1200)
