HELP_1 = """
<b>فەرمانی بۆتی زیرەکی گۆرانی:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /pause ➠ بۆ وەستاندنی پەخشکردن بۆ ماوەیەکی کاتی♥•\n
⎙ /resume ➠ بۆ دەستپێکردنەوەی پەخشکردن کاتێك وەستێنراوە♥•\n
⎙ /skip ➠ بۆ تێپەڕاندنی پەخشەکە لە گۆرانیەکەوە بۆ گۆرانی دواتر♥•\n
⎙ /end , /stop ➠ بۆ کۆتایی هێنان بە پەخشەکردن♥•\n
⎙ /player ➠ بەدەست هێنانی پانێڵی پەخشکەر♥•\n
⎙ /queue ➠ بۆ پیشاندانی تڕاکە ڕیزکراوەکانی لیست♥•</b>
"""

HELP_2 = """
<b>ᯓ فەرمانی ڕێپێدان:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

بەکاردێت بۆ کەسانێ کە ئەدمین نین بەڵام دەتوانن فەرمانی ئەدمین لە بۆت بەکاربێنن

⎙ /auth + [یوزەر] ➠ بۆ زیادکردنی بەکارهێنەری ڕێگەپێدراو بەکارهێنانی فەرمانی بۆت وەك ئەدمین♥•

⎙ /unauth + [یوزەر] ➠ بۆ سڕینەوەی بەکارهێنەری ڕێگەپێدراو لە لیستی ڕێپێدان♥•

⎙ /authusers ➠ بۆ پیشاندانی لیستی ڕێپێدان♥•</b>
"""

HELP_3 = """
<b>ᯓ فەرمانی فۆڕوارد [تەنیا بۆ گەشەپێدەرانە]:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /broadcast [نامە یان وڵامدانەوەی نامەکە] : بۆ ناردنی نامە یان هەر شتێك بۆ هەموو ئەو کەس و گرووپانەی کاریان بەبۆت کردووە🖤•\n
⎙ -pin ➠ بۆ هەڵواسینی نامەی نێردراو🖤•\n
⎙ -pinloud ➠ بۆ هەڵواسینی نامەی نێردراو لە گرووپ و چاتی کەسەکە و ناردنی ئاگاداری🖤•\n
⎙ -user ➠ ناردنی نامە بۆ ئەو کەسانەی کە کاریان بە بۆتەکە کردووە🖤•\n
⎙ -assistant ➠ ناردنی نامە بۆ ئەکاونتی یاریدەدەری بۆت🖤•\n
⎙ -nobot ➠ ناچار کردنی  بۆتەکە بۆ نەناردنی نامەکە🖤•\n
نموونە: /broadcast -user -assistant -pin ᴛᴇsᴛɪɴɢ ʙʀᴏᴀᴅᴄᴀsᴛ </b>
"""

HELP_4 = """
<b>فەرمانی لیستی باندکراوەکان: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /blacklistchat [ناسنامە،ئایدی گرووپ] ➠ لیستی ڕەشی گرووپ بە بەکارهێنانی بۆت🖤•

⎙ /whitelistchat [ناسنامە،ئایدی گرووپ] ➠ لیستی سپی گرووپ بە بەکارهێنانی بۆت🖤•

⎙ /blacklistedchat ➠ بۆ پیشاندانی لیستی ڕەشی گرووپ🖤•</b>
"""

HELP_5 = """
<b>فەرمانی بلۆککردن: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /block [یوزەر یان وەڵام دانەوە] ➠ بۆ بلۆککردنی کەسێك بۆ ئەوەی نەتوانێ فەرمانی بۆت بەکاربھێنێ🖤•\n
⎙ /unblock [یوزەر یان وەڵام دانەوە] ➠ بۆ لادانی بلۆککراو لە لیستی بلۆککراوەکان🖤•\n
⎙ /blockedusers ➠ بۆ پیشاندانی لیستی بلۆککراوەکان🖤•</b>
"""

HELP_6 = """
<b>فەرمانی پەخشکردن لە کەناڵ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /cplay ➠ بەکاردێت بۆ پەخشکردنی گۆرانی لە کەناڵ♥•

⎙ /cvplay ➠ بەکاردێت بۆ پەخشکردنی ڤیدیۆ لە کەناڵ♥•

⎙ /cplayforce یان /cvplayforce ➠ پەخشکردنی بەردەوام بوەستێنێت و دەست بکات بۆ پەخشکردنی گۆرانی داواکراو♥•

⎙ /channelplay [یوزەری یان ئایدی کەناڵ] یان [ناچالاک] ➠ پێکەوە بەستنی کەناڵ بە گرووپەوە♥•</b>
"""

HELP_7 = """
<b>فەرمانی دەرکردنی گشتی: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /gban [یوزەر یان وەڵامدانەوەی نامە] ➠ بۆ دەرکردن یان باندکردنی کەسێك لە هەموو گرووپەکان کە بۆت لێی ئەدمینە♥•\n
⎙ /ungban [یوزەر یان وەڵامدانەوەی نامە] ➠ لادانی باندی گشتی♥•\n
⎙ /gbannedusers ➠ بۆ پیشاندانی لیستی باندکراوان لە بۆتەکە♥•</b>
"""

HELP_8 = """
<b>فەرمانی لووپ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /loop [چالاک/ناچالاک] ➠ چالاک/ناچالاک کردنی فەرمانی لووپ♥•\n
⎙ /loop [1, 2, 3, ...] ➠ چالاکردنی بە ژمارەی جیاواز♥•</b>
"""

HELP_9 = """
<b>دۆخی چاککردنەوە و چالاکی بۆت: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /logger [چالاک/ناچالاک] ➠ بۆ پیشاندانی هەموو ئەو گرووپ و کەناڵانەی کار بە بۆت دەکەن🕷️•

⎙ /maintenance [چالاک/ناچالاک] ➠ بۆ چالاککردن و ناچالاککردنی دۆخی چاککردنەوە لە بۆت🕷️•</b>
"""

HELP_10 = """
<b>فەرمانی دەستپێکردن و ئامار: 
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /start ➠ بۆ دەستپێکردنی بۆتی گۆرانی♥•\n
⎙ /help ➠ بۆ پیشاندانی فەرمانی بۆت♥•\n
⎙ /reboot ➠ دووبارە کردنەوەی بۆت♥•\n
⎙ /settings ➠ بۆ پیشاندانی ڕێکبەندەکانی بۆت لە گرووپ♥•
⎙ /ping ➠ بۆ پیشاندانی پینگ و ئاماری سیستەم♥•
⎙ /stats ➠ پیشاندانی ئاماری گشتی بۆت♥•</b>
"""

HELP_11 = """
<b>فەرمانی پەخشکردن:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ c + play ➩ /cplay : بەکاردێت بۆ پەخشکردنی گۆرانی لە چەناڵ♥•\n
⎙ v + play ➩ /vplay : بەکاردێت بۆ پەخشکردنی ڤیدیۆ♥•\n
⎙ force بەکاردێت بۆ پەخشکردنی ناچاری♥•\n
⎙ /play یان /vplay یان /cplay : بۆ پەخشکردنی گۆرانی یان ڤیدیۆ♥•\n
⎙ /playforce یان /vplayforce یان /cplayforce : بۆ پەخشی ناچاری لە گرووپ و چەناڵ♥•</b>
"""

HELP_12 = """
<b>تێکەڵکردنی گۆرانی ڕیزکراو:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /shuffle ➠ بۆ تێکەڵکردنی گۆرانی ناو ڕیزکراوەکە♥•

⎙ /queue ➠ بۆ پیشاندانی ڕیز♥•</b>
"""

HELP_13 = """
<b>فەرمانی پەخشکردن بە ماوە:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /seek [ماوە بە چرکە] ➠ بۆ گەڕان بۆ پەخش و پێدانی ماوەکەی🖤•

⎙ /seekback [ماوە بە چرکە] ➠ بۆ گەڕاندنەوەی گەڕان بۆ پەخش و پێدانی ماوەکەی🖤•</b>
"""

HELP_14 = """
<b>داگرتنی گۆرانی:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /song [ناوی گۆرانی یان لینکی] ➠ بۆ داگرتنی گۆرانی لە یوتوب بە باشترین کوالێتی🖤•</b>
"""

HELP_15 = """
<b>فەرمانی خێرایی پەخشکردن:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

دەتوانی لە ڕێگای ئەم فەرمانە خێرایی پەخشکردن بگۆڕی تەنیا بۆ ئەدمینەکانە🖤•

⎙ /speed یان /playback ➠ بۆ گۆڕینی خێرایی پەخشکردن لە گرووپ♥•

⎙ /cspeed یان /cplayback ➠ بۆ گۆڕینی خێرایی پەخشکردن لە کەناڵ♥•</b>
"""

HELP_16 = """
<b>GPT:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /ask یان /ai یان /iq + پرسیار ➠ پرسیارکردن لە زیرەکی دەستکرد ♥•</b>
 """

HELP_17 = """
<b>ستیکەر:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /packkang ➠ بۆ دروستکردنی پاکێجی ستیکەر♥•
⎙ /stickerid ➠ بۆ دۆزینەوەی ئایدی ستیکەر♥•</b>
"""

HELP_18 = """
<b>تاگ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ @all + ڕیپلەی نامە یان نووسینی لەگەڵ فەرمان ➠ بۆ بانگکردنی ئەندامەکان♥•

نموونە:
@all وەرن</b>
 """

HELP_19 = """
<b>زانیاری:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /id ➠ بۆ بینینی ئایدی گرووپ و کەسەکان♥•
⎙ /info ➠ هێنانی زانیاری دەربارەی کەسێك♥•</b>
"""
HELP_20 = """
<b>گرووپ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••
ئەم فەرمانانە بەکاردێت بۆ  بەڕێوەبردنی گرووپ:
⦿ /pin ➠ هەڵواسین یان پین کردنی نامە
⦿ /pinned ➠ بینینی نامەی هەڵواسراو
⦿ /unpin ➠ لادانی نامە لە پین یان هەڵواسین
⦿ /staff ➠ بۆ بینینی ستافی ئەدمینەکانی گرووپ
⦿ /bots ➠ بۆ بینینی لیستی بۆتەکانی گرووپ
⦿ /settitle ➠ بۆ گۆڕینی ناوی گرووپ
⦿ /setdiscription ➠ بۆ گۆڕینی بایۆی گرووپ
⦿ /setphoto ➠ بۆ دانانی وێنەی نوێ بۆ گرووپ
⦿ /removephoto ➠ بۆ لادانی وێنەی گرووپ
⦿ /zombies ➠ بۆ سڕینەوە یان باندکردنی هەموو ئەکاونتە سووتاوەکانی گرووپ</b>
"""
HELP_21 = """
<b>زیادە:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⦿ /math ➠ بۆ شیکارکردنی پرسیاری بیرکاری
⦿ /carbon ➠ دروستکردنی وێنە بە ناوی خۆت
⦿ /speedtest ➠ پێوانەکردنی خێرایی بۆت
⦿ /webss ➠ سکرین شۆتی وێبسایت 
⦿ /paste ➠ 
⦿ /tgm ➠ گۆڕینی وێنە بۆ بەستەر، لینك
⦿ /tr ➠ بۆ وەرگێڕانی نووسین
⦿ /google ➠ گەڕان بۆ زانیاری لە گوگڵ
"""
HELP_22 = """
<b>وێنە:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⦿ /image + ناوی وێنە ➠ گەڕان بۆ وێنە
⦿ /upscale + ڕیپلەی وێنە ➠ بۆ جوانتر کردنی کوالێتی</b>
"""
HELP_23 = """
<b>کردارەکانی پاراستنی گرووپ:
» فەرمانی میوت باند :

 ❍ /kickme ➠ بۆ دەرکردنی خۆت لە گرووپ

❍ تەنیا بۆ ئەدمینەکان:
 ❍ /ban + یوزەر یان ڕیپلەی ➠ بۆ باندکردنی کەسێك بتەوێ
 ❍ /sban <userhandle>: Silently ban a user. Deletes command, Replied message and doesn't reply. (via handle, or reply)
 ❍ /tban <userhandle> x(m/h/d): bans a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unban <userhandle>: unbans a user. (via handle, or reply)
 ❍ /kick <userhandle>: kicks a user out of the group, (via handle, or reply)
 ❍ /mute <userhandle>: silences a user. Can also be used as a reply, muting the replied to user.
 ❍ /tmute <userhandle> x(m/h/d): mutes a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unmute <userhandle>: unmutes a user. Can also be used as a reply, muting the replied to user.
__
"""
HELP_24 = """
<b>فەرمانی گەڕان:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /google + پرسیار➠ گەڕان لە گوگڵ بۆ دۆزینەوەی پرسیارەکەت
⎙ /anime + پرسیار  ➠ گەڕان بۆ ئەنیمی لە سایتی Myanimelist
⎙ /image (/img) ناوێك ➠ هێنانی وێنەی شاز

⎙ نموونە:
  /image یان /img Car </b>
"""
