HELP_1 = """
<b>فەرمانی بۆتی زیرەکی گۆرانی:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /pause : بۆ وەستاندنی پەخشکردن بۆ ماوەیەکی کاتی♥•\n
⎙ /resume : بۆ دەستپێکردنەوەی پەخشکردن کاتێك وەستێنراوە♥•\n
⎙ /skip : بۆ تێپەڕاندنی پەخشەکە لە گۆرانیەکەوە بۆ گۆرانی دواتر♥•\n
⎙ /end , /stop : بۆ کۆتایی هێنان بە پەخشەکردن♥•\n
⎙ /player : بەدەست هێنانی پانێڵی پەخشکەر♥•\n
⎙ /queue : بۆ پیشاندانی تڕاکە ڕیزکراوەکانی لیست♥•</b>
"""

HELP_2 = """
<b>ᯓ فەرمانی ڕێپێدان:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

بەکاردێت بۆ کەسانێ کە ئەدمین نین بەڵام دەتوانن فەرمانی ئەدمین لە بۆت بەکاربێنن

⎙ /auth + [یوزەر] : بۆ زیادکردنی بەکارهێنەری ڕێگەپێدراو بەکارهێنانی فەرمانی بۆت وەك ئەدمین♥•

⎙ /unauth + [یوزەر] : بۆ سڕینەوەی بەکارهێنەری ڕێگەپێدراو لە لیستی ڕێپێدان♥•

⎙ /authusers : بۆ پیشاندانی لیستی ڕێپێدان♥•</b>
"""

HELP_3 = """
<b>ᯓ فەرمانی فۆڕوارد [تەنیا بۆ گەشەپێدەرانە]:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /broadcast [نامە یان وڵامدانەوەی نامەکە] : بۆ ناردنی نامە یان هەر شتێك بۆ هەموو ئەو کەس و گرووپانەی کاریان بەبۆت کردووە🖤•\n
⎙ -pin : بۆ هەڵواسینی نامەی نێردراو🖤•\n
⎙ -pinloud : بۆ هەڵواسینی نامەی نێردراو لە گرووپ و چاتی کەسەکە و ناردنی ئاگاداری🖤•\n
⎙ -user : ناردنی نامە بۆ ئەو کەسانەی کە کاریان بە بۆتەکە کردووە🖤•\n
⎙ -assistant : ناردنی نامە بۆ ئەکاونتی یاریدەدەری بۆت🖤•\n
⎙ -nobot : ناچار کردنی  بۆتەکە بۆ نەناردنی نامەکە🖤•\n
نموونە: /broadcast -user -assistant -pin ᴛᴇsᴛɪɴɢ ʙʀᴏᴀᴅᴄᴀsᴛ </b>
"""

HELP_4 = """
<b>فەرمانی لیستی باندکراوەکان: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /blacklistchat [ناسنامە،ئایدی گرووپ] : لیستی ڕەشی گرووپ بە بەکارهێنانی بۆت🖤•

⎙ /whitelistchat [ناسنامە،ئایدی گرووپ] : لیستی سپی گرووپ بە بەکارهێنانی بۆت🖤•

⎙ /blacklistedchat : بۆ پیشاندانی لیستی ڕەشی گرووپ🖤•</b>
"""

HELP_5 = """
<b>فەرمانی بلۆککردن: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /block [یوزەر یان وەڵام دانەوە] : بۆ بلۆککردنی کەسێك بۆ ئەوەی نەتوانێ فەرمانی بۆت بەکاربھێنێ🖤•\n
⎙ /unblock [یوزەر یان وەڵام دانەوە] : بۆ لادانی بلۆککراو لە لیستی بلۆککراوەکان🖤•\n
⎙ /blockedusers : بۆ پیشاندانی لیستی بلۆککراوەکان🖤•</b>
"""

HELP_6 = """
<b>فەرمانی پەخشکردن لە کەناڵ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /cplay : بەکاردێت بۆ پەخشکردنی گۆرانی لە کەناڵ♥•

⎙ /cvplay : بەکاردێت بۆ پەخشکردنی ڤیدیۆ لە کەناڵ♥•

⎙ /cplayforce یان /cvplayforce : پەخشکردنی بەردەوام بوەستێنێت و دەست بکات بۆ پەخشکردنی گۆرانی داواکراو♥•

⎙ /channelplay [یوزەری یان ئایدی کەناڵ] یان [ناچالاک] : پێکەوە بەستنی کەناڵ بە گرووپەوە♥•</b>
"""

HELP_7 = """
<b>فەرمانی دەرکردنی گشتی: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /gban [یوزەر یان وەڵامدانەوەی نامە] : بۆ دەرکردن یان باندکردنی کەسێك لە هەموو گرووپەکان کە بۆت لێی ئەدمینە♥•\n
⎙ /ungban [یوزەر یان وەڵامدانەوەی نامە] : لادانی باندی گشتی♥•\n
⎙ /gbannedusers : بۆ پیشاندانی لیستی باندکراوان لە بۆتەکە♥•</b>
"""

HELP_8 = """
<b>فەرمانی لووپ:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /loop [چالاک/ناچالاک] : چالاک/ناچالاک کردنی فەرمانی لووپ♥•\n
⎙ /loop [1, 2, 3, ...] : چالاکردنی بە ژمارەی جیاواز♥•</b>
"""

HELP_9 = """
<b>دۆخی چاککردنەوە و چالاکی بۆت: تەنیا بۆ گەشەپێدەرانە
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /logger [چالاک/ناچالاک] : بۆ پیشاندانی هەموو ئەو گرووپ و کەناڵانەی کار بە بۆت دەکەن🕷️•

⎙ /maintenance [چالاک/ناچالاک] : بۆ چالاککردن و ناچالاککردنی دۆخی چاککردنەوە لە بۆت🕷️•</b>
"""

HELP_10 = """
<b>فەرمانی دەستپێکردن و ئامار: 
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /start : بۆ دەستپێکردنی بۆتی گۆرانی♥•\n
⎙ /help : بۆ پیشاندانی فەرمانی بۆت♥•\n
⎙ /reboot : دووبارە کردنەوەی بۆت♥•\n
⎙ /settings : بۆ پیشاندانی ڕێکبەندەکانی بۆت لە گرووپ♥•
⎙ /ping : بۆ پیشاندانی پینگ و ئاماری سیستەم♥•
⎙ /stats : پیشاندانی ئاماری گشتی بۆت♥•</b>
"""

HELP_11 = """
<b>فەرمانی پەخشکردن:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ c + play ➩ /cplay : بەکاردێت بۆ پەخشکردنی گۆرانی لە چەناڵ♥•\n
⎙ v + play ➩ /vplay : بەکاردێت بۆ پەخشکردنی ڤیدیۆ♥•\n
⎙ force بەکاردێت بۆ پەخشکردنی ناچاری♥•\n
⎙ /play یان /vplay یان /cplay : بۆ پەخشکردنی گۆرانی یان ڤیدیۆ♥•\n
⎙ /playforce یان /vplayforce یان /cplayforce : بۆ پەخشی ناچاری لە گرووپ و چەناڵ♥•</b>
"""

HELP_12 = """
<b>تێکەڵکردنی گۆرانی ڕیزکراو:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /shuffle : بۆ تێکەڵکردنی گۆرانی ناو ڕیزکراوەکە♥•

⎙ /queue : بۆ پیشاندانی ڕیز♥•</b>
"""

HELP_13 = """
<b>فەرمانی پەخشکردن بە ماوە:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /seek [ماوە بە چرکە] : بۆ گەڕان بۆ پەخش و پێدانی ماوەکەی🖤•

⎙ /seekback [ماوە بە چرکە] : بۆ گەڕاندنەوەی گەڕان بۆ پەخش و پێدانی ماوەکەی🖤•</b>
"""

HELP_14 = """
<b>داگرتنی گۆرانی:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

⎙ /song [ناوی گۆرانی یان لینکی] : بۆ داگرتنی گۆرانی لە یوتوب بە باشترین کوالێتی🖤•</b>
"""

HELP_15 = """
<b>فەرمانی خێرایی پەخشکردن:
••┉┉┉┉┉┉••🝢••┉┉┉┉┉┉••

دەتوانی لە ڕێگای ئەم فەرمانە خێرایی پەخشکردن بگۆڕی تەنیا بۆ ئەدمینەکانە🖤•

⎙ /speed یان /playback : بۆ گۆڕینی خێرایی پەخشکردن لە گرووپ♥•

⎙ /cspeed یان /cplayback : بۆ گۆڕینی خێرایی پەخشکردن لە کەناڵ♥•</b>
"""

HELP_16 = """
<b><u>CʜᴀᴛGPT :</b></u>

 /ask ➠ ǫᴜᴇʀɪᴇs ᴛʜᴇ ᴀɪ ᴍᴏᴅᴇʟ ᴛᴏ ɢᴇᴛ ᴀ ʀᴇsᴘᴏɴsᴇ ᴛᴏ ʏᴏᴜʀ ǫᴜᴇsᴛɪᴏɴ.
 """

HELP_17 = """
<b><u>sᴛɪᴄᴋᴇʀs :</b></u>

/packkang ➠ ᴄʀᴇᴀᴛᴇs ᴀ ᴘᴀᴄᴋ ᴏғ sᴛɪᴄᴋᴇʀs ғʀᴏᴍ ᴀ ᴏᴛʜᴇʀ ᴘᴀᴄᴋ.
/stickerid ➠ ɢᴇᴛs ᴛʜᴇ sᴛɪᴄᴋᴇʀ ɪᴅ ᴏғ ᴀ sᴛɪᴄᴋᴇʀ.
"""

HELP_18 = """
<b><u>Tᴀɢ-Aʟʟ :</b></u>

 /tagall ᴏʀ @all '(ʀᴇᴘʟʏ ᴛᴏ ᴍᴇssᴀɢᴇ ᴏʀ ᴀᴅᴅ ᴀɴᴏᴛʜᴇʀ ᴍᴇssᴀɢᴇ) ᴛᴏ ᴍᴇɴᴛɪᴏɴ ᴀʟʟ ᴍᴇᴍʙᴇʀs ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ, ᴡɪᴛʜᴏᴜᴛ ᴇxᴄᴇᴘᴛɪᴏɴ.
 """

HELP_19 = """
<b><u>Iɴꜰᴏ :</b></u>

/id : ɢᴇᴛ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ɢʀᴏᴜᴘ ɪᴅ. ɪғ ᴜsᴇᴅ ʙʏ ʀᴇᴘʟʏɪɴɢ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ, ɢᴇᴛs ᴛʜᴀᴛ ᴜsᴇʀ's ɪᴅ.
/info : ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜsᴇʀ
"""
HELP_20 = """
<b><u>Gʀᴏᴜᴘ :</b></u>
ᴛʜᴇsᴇ ᴀʀᴇ ᴛʜᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ɢʀᴏᴜᴘ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ ᴄᴏᴍᴍᴀɴᴅs:

⦿ /pin ➠ ᴘɪɴs ᴀ ᴍᴇssᴀɢᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /pinned ➠ ᴅɪsᴘʟᴀʏs ᴛʜᴇ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /unpin ➠ ᴜɴᴘɪɴs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛʟʏ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ.
⦿ /staff ➠ ᴅɪsᴘʟᴀʏs ᴛʜᴇ ʟɪsᴛ ᴏғ sᴛᴀғғ ᴍᴇᴍʙᴇʀs.
⦿ /bots ➠ ᴅɪsᴘʟᴀʏs ᴛʜᴇ ʟɪsᴛ ᴏғ ʙᴏᴛs ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /settitle ➠ sᴇᴛs ᴛʜᴇ ᴛɪᴛʟᴇ ᴏғ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /setdiscription ➠ sᴇᴛs ᴛʜᴇ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ ᴏғ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /setphoto ➠ sᴇᴛs ᴛʜᴇ ɢʀᴏᴜᴘ ᴘʜᴏᴛᴏ.
⦿ /removephoto ➠ ʀᴇᴍᴏᴠᴇs ᴛʜᴇ ɢʀᴏᴜᴘ ᴘʜᴏᴛᴏ.
⦿ /zombies ➠ ʀᴇᴍᴏᴠᴇs ᴀᴄᴄ ᴅᴇʟᴇᴛᴇᴅ ᴍᴇᴍʙᴇʀs ғʀᴏᴍ ᴛʜᴇ ɢʀᴏᴜᴘ.
⦿ /imposter ᴏɴ/ᴏғғ ➠ ᴛᴜʀɴs ᴏɴ ᴏʀ ᴏғғ ᴛʜᴇ ᴡᴀᴛᴄʜᴇʀ ғᴏʀ ʏᴏᴜʀ ɢʀᴏᴜᴘ, ᴡʜɪᴄʜ ɴᴏᴛɪғɪᴇs ᴀʙᴏᴜᴛ ᴜsᴇʀs ᴡʜᴏ ᴄʜᴀɴɢᴇ ᴛʜᴇɪʀ ɴᴀᴍᴇ ᴏʀ ᴜsᴇʀɴᴀᴍᴇ.
"""
HELP_21 = """
<b><u>Exᴛʀᴀ :</b></u>

⦿ /math ➠ sᴏʟᴠᴇs ᴍᴀᴛʜᴇᴍᴀᴛɪᴄᴀʟ ᴘʀᴏʙʟᴇᴍs ᴀɴᴅ ᴇǫᴜᴀᴛɪᴏɴs.
⦿ /blackpink ➠ ɢᴇɴᴇʀᴀᴛᴇs ᴀ ʙʟᴀᴄᴋᴘɪɴᴋ-sᴛʏʟᴇ ʟᴏɢᴏ.
⦿ /carbon ➠ ɢᴇɴᴇʀᴀᴛᴇs ᴀ ᴄᴀʀʙᴏɴ ᴄᴏᴅᴇ ɪᴍᴀɢᴇ ғʀᴏᴍ ᴀ ᴄᴏᴅᴇ sɴɪᴘᴘᴇᴛ.
⦿ /speedtest ➠ ᴍᴇᴀsᴜʀᴇs ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ sᴘᴇᴇᴅ.
⦿ /reverse ➠ ʀᴇᴠᴇʀsᴇs ᴀ ɢɪᴠᴇɴ ᴛᴇxᴛ.
⦿ /webss ➠ ᴛᴀᴋᴇs ᴀ sᴄʀᴇᴇɴsʜᴏᴛ ᴏғ ᴀ ᴡᴇʙsɪᴛᴇ.
⦿ /paste ➠ ᴜᴘʟᴏᴀᴅs ᴀ ᴛᴇxᴛ sɴɪᴘᴘᴇᴛ ᴛᴏ ᴛʜᴇ ᴄʟᴏᴜᴅ ᴀɴᴅ ɢɪᴠᴇs ᴀ ʟɪɴᴋ.
⦿ /tgm ➠ ᴜᴘʟᴏᴀᴅs ᴀ ᴘʜᴏᴛᴏ (ᴜɴᴅᴇʀ 𝟻ᴍʙ) ᴛᴏ ᴛʜᴇ ᴄʟᴏᴜᴅ ᴀɴᴅ ɢɪᴠᴇs ᴀ ʟɪɴᴋ.
⦿ /tr ➠ ᴛʀᴀɴsʟᴀᴛᴇs ᴛᴇxᴛ.
⦿ /google ➠ sᴇᴀʀᴄʜᴇs ғᴏʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴏɴ ɢᴏᴏɢʟᴇ.
⦿ /stack ➠ sᴇᴀʀᴄʜᴇs ғᴏʀ ᴘʀᴏɢʀᴀᴍᴍɪɴɢ-ʀᴇʟᴀᴛᴇᴅ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴏɴ sᴛᴀᴄᴋ ᴏᴠᴇʀғʟᴏᴡ.
"""
HELP_22 = """
<b><u>Iᴍᴀɢᴇ :</b></u>
ᴛʜᴇsᴇ ᴀʀᴇ ᴛʜᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ɪᴍᴀɢᴇ ᴄᴏᴍᴍᴀɴᴅs:

⦿ /draw ➠ ɢᴇɴᴇʀᴀᴛᴇs ᴀ ᴅʀᴀᴡɪɴɢ ʙᴀsᴇᴅ ᴏɴ ᴀ ɢɪᴠᴇɴ ᴘᴏʀᴏᴍᴘᴛ.
⦿ /image ➠ sᴇᴀʀᴄʜᴇs ғᴏʀ ᴀɴ ɪᴍᴀɢᴇ ʙᴀsᴇᴅ ᴏɴ ᴀ ɢɪᴠᴇɴ ᴋᴇʏᴡᴏʀᴅ.
⦿ /upscale ➠ ʀᴇᴘʟʏ ᴛᴏ ᴀɴ ɪᴍᴀɢᴇ ᴛᴏ ᴜᴘsᴄᴀʟᴇ ɪᴛ ᴀɴᴅ ɪᴍᴘʀᴏᴠᴇ ɪᴛs ǫᴜᴀʟɪᴛʏ.
"""
HELP_23 = """
<b><u>Aᴄᴛɪᴏɴ :</b></u>
» ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs ꜰᴏʀ Bᴀɴs & Mᴜᴛᴇ :

 ❍ /kickme: kicks the user who issued the command

Admins only:
 ❍ /ban <userhandle>: bans a user. (via handle, or reply)
 ❍ /sban <userhandle>: Silently ban a user. Deletes command, Replied message and doesn't reply. (via handle, or reply)
 ❍ /tban <userhandle> x(m/h/d): bans a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unban <userhandle>: unbans a user. (via handle, or reply)
 ❍ /kick <userhandle>: kicks a user out of the group, (via handle, or reply)
 ❍ /mute <userhandle>: silences a user. Can also be used as a reply, muting the replied to user.
 ❍ /tmute <userhandle> x(m/h/d): mutes a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
 ❍ /unmute <userhandle>: unmutes a user. Can also be used as a reply, muting the replied to user.
__
𝐒ᴘᴇᴄɪᴀʟ 𝐂ᴏᴍᴍᴀɴᴅs 𝐒ᴜᴘᴘᴏʀᴛ 𝐀ʟʟ 𝐄xᴀᴍᴘʟᴇ  - 𝚈𝚞𝚖𝚒 𝚋𝚊𝚗 𝚈𝚞𝚖𝚒 𝚖𝚞𝚝𝚎 𝚈𝚞𝚖𝚒 𝚙𝚛𝚘𝚖𝚘𝚝𝚎 ..... 𝚎𝚝𝚌
"""
HELP_24 = """
<b><u>Sᴇᴀʀᴄʜ :</b></u>
Available commands:
• /google <query> : Search the google for the given query.
• /anime <query>  : Search myanimelist for the given query.
• /stack <query>  : Search stackoverflow for the given query.
• /image (/imgs) <query> : Get the images regarding to your query

Example:
/google pyrogram: return top 5 reuslts.
"""
